<p align="center" >
<a href="https://www.wdc.ng/">
<img src='https://images.yalwa.com.ng/Wild-Fusion-Digital-Centre/vap_1019131596.png'>
</a>
</p>

### Pandas Series Exercise

In [1]:
import pandas as pd

In [83]:
import numpy as np

In [38]:
# Exercise
labels = ['a','b','c','d','e']
data = [10, 20, 30, 40, 50]
data_dict = {'A': 10, 'B': 20, 'C': 30, 'D': 40, 'E': 50}
# create series with the List(labels & data)
my_series = pd.Series(data,labels)
my_series
# create series with the Dictonary{data_dict}
my_dict = pd.Series(data_dict)

my_dict

print(my_dict['C'])
print(my_dict['D'])

30
40

In [9]:
data = [10, 20, 30, 40, 50]

In [39]:
labels = pd.Series(data,['a','b','c','d','e'])

In [40]:
labels

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [41]:
labels.values

array([10, 20, 30, 40, 50], dtype=int64)

In [22]:
data.index

### Pandas DataFrame Exercise

In [81]:
# Dataframe Exercise
data2 = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}
# syntax to convert my datas to dataframe
data2 = pd.DataFrame(data2)
# call my variable to print 
data2

data2['City']

# Dataframe Exercise 2
data2 = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}
data2['Last_Name'] = ['Bulus', 'Marly','Okon']
data2 = pd.DataFrame(data2)

In [68]:
#no_age=data2.drop('Age',axis=1,inplace=True)

In [66]:
data2 = pd.DataFrame(data2)
data2

      Name           City Last_Name
0    Alice       New York     Bulus
1      Bob  San Francisco     Marly
2  Charlie    Los Angeles      Okon

In [77]:
data2.iloc[1]

Name                   Bob
City         San Francisco
Last_Name            Marly
Name: 1, dtype: object

In [75]:
data2.set_index('Last_Name').loc['Marly']

Name              Bob
City    San Francisco
Name: Marly, dtype: object

In [73]:
name.loc['Marly']

Name              Bob
City    San Francisco
Name: Marly, dtype: object

In [ ]:
data2['Last_Name'] = ['Bulus', 'Marly','Okon']
data2 = pd.DataFrame(data2)

In [82]:
data2[data2['City']=='San Francisco']

  Name  Age           City Last_Name
1  Bob   30  San Francisco     Marly

### Pandas Groupby Exercise

In [43]:
data3 = {'Region': ['North', 'North', 'South', 'South', 'East'],
        'Category': ['Electronics', 'Furniture', 'Electronics', 'Furniture', 'Electronics'],
        'Sales': [1000, 800, 1200, 900, 1500],
        'Profit': [200, 100, 250, 120, 300]}
df = pd.DataFrame(data3)
df[]

### Joins

In [86]:
data4 = {'ID': [1, 2, 3],
         'Name': ['Alice', 'Bob', 'Charlie']}
data5 = {'ID': [2, 3, 4],
         'Age': [25, 30, 35]}

df1 = pd.DataFrame(data4)
df2 = pd.DataFrame(data5)

### Pivot Table Exercise

In [87]:
data6 = {'Category': ['A', 'B', 'A', 'B', 'A'],
        'Region': ['North', 'North', 'South', 'South', 'East'],
        'Sales': [100, 200, 150, 250, 120]}

# NAN